# OwnerViewId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..OwnerViewId Property
Element Class See Also
---
The id of the view that owns the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId OwnerViewId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OwnerViewId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ OwnerViewId {
	ElementId^ get ();
}
```

# See Also
Element Class
Autodesk.Revit.DB Namespace